Database Admin with Python

In [1]:
#imports
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.engine import create_engine
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists

In [2]:
#create connection string
username = "root"
password = quote_plus("Jake2006!")
db_name = "tshirts"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
#create the engine
engine = create_engine(connection_str)

In [4]:
#create a new database
create_database(connection_str)

In [5]:
#verify that the database was created
database_exists(connection_str)

True

In [6]:
#solving errors when running create_database for a 2nd time
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [7]:
#Making a data frame a table in a MySQL database
df = pd.read_csv('data/Tshirt.csv')
df.head()

  Size  Color  Cost Sold
0    S   Blue  5.00    Y
1    M    Red  7.49    Y
2    M  Green  8.00    N
3   XL  Green  4.00    N
4    L    Red  9.99    Y

In [8]:
#add the table to the database
df.to_sql('tshirts', engine, if_exists = 'replace')

9

In [9]:
q = """SELECT * FROM tshirts LIMIT 5;"""
pd.read_sql(q, engine)

   index Size  Color  Cost Sold
0      0    S   Blue  5.00    Y
1      1    M    Red  7.49    Y
2      2    M  Green  8.00    N
3      3   XL  Green  4.00    N
4      4    L    Red  9.99    Y

In [10]:
#see all of the tables that exist in the current database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_tshirts
0           tshirts